-- start test data for developing
INSERT INTO
    admin_db.part_and_service (description, type)
VALUES
    ('Автобензин АИ-95', 1),
    ('Мойка машины', 2),
    (
        'Клипсы обивки, шайба резиновая, для креп. защ. зад. пруж. и балки ROMIX C60134',
        3
    ),
    (
        'Винт саморез 5*16 с головкой TORX T25 VAG N90974701 к пистону 6N0809966A',
        3
    ),
    (
        'БОЛТ М10Х75Х45 крепления нижн. части зад. стойки VAG N90517304',
        3
    ),
    (
        'Гайка прижимная для креп. защ. зад. пруж. и балки VAG N10433701',
        3
    ),
    (
        'Опора переднего аммортизатора верхняя VAG 1J0412319C',
        3
    ),
    (
        'Пылезащитный комплект зад. аммортизатора KYB 915400',
        3
    ),
    (
        'Тормозные колодки передние комплект TRW GDB2108',
        3
    ),
    (
        'Жидкость тормозная DOT 4, "NIRO Brake Fluid", 0.5л Totachi 90250',
        3
    ),
    ('Лампочки повортников', 3),
    (
        'Шестигранная гайка с буртиком, самоконтрящаяся, креп. стойки к кулаку M12X1,5 VAG N10106402',
        3
    ),
    (
        'Головка торцевая ударная 12 гранная на 36 посад. 1/2 AIRLINE ATIS1249',
        3
    ),
    (
        'Тарелка пружины верхняя VAG 6R0412341B (возможный аналог VAG 6R0412341A) на перед. стойку',
        3
    ),
    (
        'Винт самонарез. с внутр. TORX 4,8X22 креп. перед. подкрылка VAG N90651302',
        3
    ),
    (
        'Винт саморез 5*16 с головкой TORX T25 креп. перед./зад. подкрылка VAG N90974701',
        3
    ),
    (
        'Гайка двенадцатигранная ступицы колеса переднего M16X1,5 VAG 6Q0407396B',
        3
    ),
    (
        'Гайка шестигранная самоконтр., креп. штока стойки к чашке кузова M14X1,50 VAG N90353604',
        3
    ),
    (
        'Винт со скр.цил.гол.,внут.TORX, креп. стойки к поворот. кулаку M12X1,5X80 VAG N90954802',
        3
    ),
    (
        'Резьбовая втулка, крепления пружины к стойке M14X1,5 VAG 1H0412365A',
        3
    ),
    (
        'Шестигранная гайка с буртиком, креп. стойки к стабилизатору M10X1,5 VAG N90908102',
        3
    );

INSERT INTO
    admin_db.spending (
        date,
        part_and_service_id,
        description,
        count,
        amount
    )
VALUES
    ('2024-06-01', 1, NULL, 30.0, 1617.0),
    ('2024-06-07', 3, NULL, 8.0, 336.0),
    ('2024-06-07', 4, NULL, 5.0, 265.0),
    ('2024-06-07', 5, NULL, 4.0, 937.28),
    ('2024-06-07', 6, NULL, 8.0, 368.0),
    ('2024-06-07', 7, NULL, 2.0, 2299.0),
    (
        '2024-06-07',
        2,
        'ополаскивание кузова',
        1.0,
        100.0
    ),
    ('2024-06-07', 8, NULL, 2.0, 1309.0),
    ('2024-06-10', 1, NULL, 35.0, 1886.5),
    ('2024-06-12', 2, '2 коврика', 1.0, 150.0),
    (
        '2024-06-15',
        2,
        '2 коврика + пылесос',
        1.0,
        190.0
    ),
    ('2024-06-16', 1, NULL, 30.0, 1615.5),
    ('2024-06-25', 1, NULL, 30.0, 1621.5),
    ('2024-06-26', 9, NULL, 1.0, 2821.0),
    ('2024-06-26', 10, NULL, 0.5, 300.0),
    ('2024-06-27', 2, '2 коврика', 1.0, 150.0),
    ('2024-06-27', 11, NULL, 2.0, 120.0),
    ('2024-06-28', 1, NULL, 20.0, 1096.0),
    ('2024-06-29', 12, NULL, 2.0, 286.0),
    ('2024-06-29', 13, NULL, 1.0, 476.0),
    ('2024-06-29', 14, NULL, 1.0, 2940.0),
    ('2024-06-29', 15, NULL, 10.0, 690.0),
    ('2024-06-29', 16, NULL, 20.0, 1060.0),
    ('2024-06-29', 17, NULL, 2.0, 1364.0),
    ('2024-06-29', 18, NULL, 2.0, 406.0),
    ('2024-06-29', 19, NULL, 2.0, 862.0),
    ('2024-06-29', 20, NULL, 2.0, 636.0),
    ('2024-06-29', 21, NULL, 2.0, 523.0);